E. Скорая помощь
Не решена
Ограничение времени	1 секунда
Ограничение памяти	64 Мб
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Бригада скорой помощи выехала по вызову в один из отдаленных районов. К сожалению, когда диспетчер получил вызов, он успел записать только адрес дома и номер квартиры 
K
1
K 
1
​
 , а затем связь прервалась. Однако он вспомнил, что по этому же адресу дома некоторое время назад скорая помощь выезжала в квартиру 
K
2
K 
2
​
 , которая расположена в подъезде 
P
2
P 
2
​
  на этаже 
N
2
N 
2
​
 . Известно, что в доме 
M
M этажей и количество квартир на каждой лестничной площадке одинаково. Напишите программу, которая вычисляет номер подъезда 
P
1
P 
1
​
  и номер этажа 
N
1
N 
1
​
  квартиры 
K
1
K 
1
​
 .

Формат ввода
Во входном файле записаны пять положительных целых чисел 
K
1
K 
1
​
 , 
M
M, 
K
2
K 
2
​
 , 
P
2
P 
2
​
 , 
N
2
N 
2
​
 . Все числа не превосходят 
1
0
6
10 
6
 .

Формат вывода
Выведите два числа 
P
1
P 
1
​
  и 
N
1
N 
1
​
 . Если входные данные не позволяют однозначно определить 
P
1
P 
1
​
  или 
N
1
N 
1
​
 , вместо соответствующего числа напечатайте 
0
0. Если входные данные противоречивы, напечатайте два числа 
–
1
–1 (минус один).

Пример 1
Ввод
Вывод
89 20 41 1 11
2 3
Пример 2
Ввод
Вывод
11 1 1 1 1
0 1
Пример 3
Ввод
Вывод
3 2 2 2 1
